require('dotenv').config();
const TelegramBot = require('node-telegram-bot-api');

const token = process.env.T_BOT_TOKEN;

// Его можно получить, например, через @userinfobot
const adminChatId = '438708073';

const bot = new TelegramBot(token, { polling: true });

// Текст приветственного сообщения с шаблонами и вопросами
const welcomeMessage = `🎉 Привет! Давай создадим твою уникальную цифровую открытку 💌\n\nОтправь мне по очереди:\n\n1. Какой стиль тебе нравится? (выбери номер на картинках)\n2. Имя получателя подарка\n3. От кого открытка\n4. Дата, с которой начинать отсчет дней любви (например, дата знакомства)\n5. Текст сообщения для открытки\n6. Фото, которое хочешь добавить в открытку ❤️\n\n
Каждая открытка стоит 499р, действует постоплата.`;

// Обработка команды /start
bot.onText(/\/start/, (msg) => {
    const chatId = msg.chat.id;

    bot.sendMessage(chatId, welcomeMessage).then(() => {
        const templates = [
            { type: 'photo', media: 'https://storage.yandexcloud.net/templates-img/variant1.png', caption: 'Стиль 1' },
            { type: 'photo', media: 'https://storage.yandexcloud.net/templates-img/variant2.png', caption: 'Стиль 2' },
            { type: 'photo', media: 'https://storage.yandexcloud.net/templates-img/variant3.png', caption: 'Стиль 3' },
            { type: 'photo', media: 'https://storage.yandexcloud.net/templates-img/variant4.png', caption: 'Стиль 4' }
        ];

        bot.sendMediaGroup(chatId, templates);
    });
});

// Обработка всех текстовых сообщений от пользователей
bot.on('message', (msg) => {
    const chatId = msg.chat.id;
    const userId = msg.from.id; // ID пользователя (может отличаться от username)
    const userName = msg.from.username ? `@${msg.from.username}` : `ID: ${userId}`;
    const userMessage = msg.text;

    // Проверяем, что сообщение пришло не от администратора (чтобы не отправлять себе ответы)
    if (chatId.toString() !== adminChatId) {
        // Формируем сообщение для администратора
        const adminMessage = `🔔 Новое сообщение от клиента:\n\nПользователь: ${userName}\nID: ${userId}\nСообщение: ${userMessage}`;

        // Отправляем сообщение администратору
        bot.sendMessage(adminChatId, adminMessage)
            .then(() => {
                // После успешной отправки, отвечаем пользователю
                bot.sendMessage(chatId, 'Спасибо за заявку! Открытка уже в разработке... Наши менеджеры свяжутся с вами в ближайшее время.');
            })
            .catch((error) => {
                console.error('Ошибка при отправке администратору:', error);
                // Также информируем пользователя об ошибке, если не удалось отправить админу
                bot.sendMessage(chatId, 'Произошла ошибка при обработке заявки. Пожалуйста, попробуйте позже.');
            });
    }
});
